In [1]:
import pandas as pd
import numpy as np

## Create DataFrame

In [17]:
data = {'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'person':['sam','charlie','amy','vanessa','carl','sarah'],
        'sales':[200,120,340,124,243,330]}

In [18]:
df = pd.DataFrame(data)

In [19]:
df

  company   person  sales
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      amy    340
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    330

## Group By a Column

In [20]:
df.groupby(by='company').sum()

         sales
company
FB         573
GOOG       320
MSFT       464

#### OR

In [21]:
company = df.groupby(by='company')

In [22]:
company.mean()

         sales
company
FB       286.5
GOOG     160.0
MSFT     232.0

## Index Off of Group By Results

In [24]:
company.sum().loc[['FB','GOOG']]

         sales
company
FB         573
GOOG       320

In [26]:
company.sum().loc['GOOG']

sales    320
Name: GOOG, dtype: int64

In [28]:
company.sum().loc[['GOOG']]

         sales
company
GOOG       320

In [42]:
df.groupby(by='company').sum().loc['MSFT']

sales    464
Name: MSFT, dtype: int64

## Descriptive Statistics Group By

In [43]:
df.groupby(by='company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  286.5   61.518290  243.0  264.75  286.5  308.25  330.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

#### Or

In [46]:
df.groupby(by='company').describe().transpose()

company             FB        GOOG        MSFT
sales count    2.00000    2.000000    2.000000
      mean   286.50000  160.000000  232.000000
      std     61.51829   56.568542  152.735065
      min    243.00000  120.000000  124.000000
      25%    264.75000  140.000000  178.000000
      50%    286.50000  160.000000  232.000000
      75%    308.25000  180.000000  286.000000
      max    330.00000  200.000000  340.000000